Pics/YCSB/old/kv_hash.log
./kv/release/tests/db/kv_bench --cache_size=8388608 --logpath=/mnt/ssd --db=/mnt/nvm/kv_ycsb --threads=4 --open_files=40000 --num=1500000000 --range=1500000000 --reads=2000000 --partition=100 --write_buffer_size=2097152 --batch_size=1000 --stats_interval=1000000 --bloom_bits=10 --low_pool=3 --high_pool=3 --value_size=100 --direct_io=false --histogram=true --log=true --skiplistrep=false --benchmarks=loadreverse,ycsbc,ycsbb,ycsbd,ycsba,ycsbf,ycsbe,stats --ycsb_ops_num=8000000 --seek_nexts=100 --use_existing_db=true --print_wa=true --log_dio=true --hugepage=true 
Bench num: 1500000000, range: 1500000000
Keys:       16 bytes each
Values:     100 bytes each (50 bytes after compression)
Entries:    1500000000
RawSize:    165939.3 MB (estimated)
FileSize:   94413.8 MB (estimated)
WARNING: Snappy compression is not enabled
------------------------------------------------
Write buffer: 2048.00 KB. Compression: 0. 
Restore 716 pivots
Recover seq# 1500104000, log# 1367, min log#1357, file# 115307
using restored pivots
Log_Recover_Time, 0.0000, BucketCount, 716 , Log_size, 0.0 ,MB
loadreverse  : 105643278.000 micros/op 0 ops/sec;
Microseconds per op:
Count: 0 Average: 0.0000  StdDev: 0.00
Min: 0  Median: 0.0000  Max: 0
Percentiles: P50: 0.00 P75: 0.00 P99: 0.00 P99.9: 0.00 P99.99: 0.00
------------------------------------------------------

2019/09/19-21:56:46  ... thread 2: (1000000,1000000) ops and (5727.1,5727.1) ops/second in (174.608500,174.608500) seconds
2019/09/19-21:56:47  ... thread 3: (1000000,1000000) ops and (5717.9,5717.9) ops/second in (174.890196,174.890196) seconds
2019/09/19-21:56:47  ... thread 1: (1000000,1000000) ops and (5695.7,5695.7) ops/second in (175.571142,175.571142) seconds
2019/09/19-21:56:48  ... thread 0: (1000000,1000000) ops and (5671.4,5671.4) ops/second in (176.323447,176.323447) seconds
2019/09/19-21:59:03  ... thread 2: (1000000,2000000) ops and (7340.2,6434.1) ops/second in (136.235524,310.844024) seconds
2019/09/19-21:59:03  ... thread 1: (1000000,2000000) ops and (7355.7,6420.1) ops/second in (135.948558,311.519700) seconds
2019/09/19-21:59:07  ... thread 0: (1000000,2000000) ops and (7210.2,6348.9) ops/second in (138.692979,315.016426) seconds
2019/09/19-21:59:08  ... thread 3: (1000000,2000000) ops and (7095.2,6332.5) ops/second in (140.940349,315.830545) seconds
2019/09/19-22:01:13  ... thread 2: (1000000,3000000) ops and (7693.8,6805.5) ops/second in (129.975219,440.819243) seconds
2019/09/19-22:01:13  ... thread 1: (1000000,3000000) ops and (7683.2,6792.3) ops/second in (130.154800,441.674500) seconds
2019/09/19-22:01:17  ... thread 0: (1000000,3000000) ops and (7692.9,6741.5) ops/second in (129.990546,445.006972) seconds
2019/09/19-22:01:25  ... thread 3: (1000000,3000000) ops and (7256.7,6613.3) ops/second in (137.803291,453.633836) seconds
2019/09/19-22:03:23  ... thread 2: (1000000,4000000) ops and (7649.2,6998.5) ops/second in (130.732628,571.551871) seconds
2019/09/19-22:03:27  ... thread 1: (1000000,4000000) ops and (7514.9,6959.6) ops/second in (133.068323,574.742823) seconds
2019/09/19-22:03:36  ... thread 3: (1000000,4000000) ops and (7666.5,6848.5) ops/second in (130.436809,584.070645) seconds
2019/09/19-22:03:36  ... thread 0: (1000000,4000000) ops and (7171.5,6844.1) ops/second in (139.440303,584.447275) seconds
2019/09/19-22:05:33  ... thread 2: (1000000,5000000) ops and (7698.4,7128.1) ops/second in (129.897074,701.448945) seconds
2019/09/19-22:05:36  ... thread 1: (1000000,5000000) ops and (7711.5,7098.0) ops/second in (129.677075,704.419898) seconds
2019/09/19-22:05:47  ... thread 0: (1000000,5000000) ops and (7634.0,6988.7) ops/second in (130.992106,715.439381) seconds
2019/09/19-22:05:49  ... thread 3: (1000000,5000000) ops and (7485.5,6967.1) ops/second in (133.591031,717.661676) seconds
2019/09/19-22:07:44  ... thread 2: (1000000,6000000) ops and (7618.5,7205.4) ops/second in (131.259285,832.708230) seconds
2019/09/19-22:07:47  ... thread 1: (1000000,6000000) ops and (7660.4,7186.0) ops/second in (130.542207,834.962105) seconds
2019/09/19-22:08:00  ... thread 0: (1000000,6000000) ops and (7513.9,7071.1) ops/second in (133.087080,848.526461) seconds
2019/09/19-22:08:00  ... thread 3: (1000000,6000000) ops and (7637.0,7070.4) ops/second in (130.941102,848.602778) seconds
2019/09/19-22:09:54  ... thread 2: (1000000,7000000) ops and (7711.5,7273.6) ops/second in (129.675732,962.383962) seconds
2019/09/19-22:09:56  ... thread 1: (1000000,7000000) ops and (7712.1,7256.7) ops/second in (129.667045,964.629150) seconds
2019/09/19-22:10:10  ... thread 3: (1000000,7000000) ops and (7716.8,7156.1) ops/second in (129.587338,978.190116) seconds
2019/09/19-22:10:16  ... thread 0: (1000000,7000000) ops and (7384.3,7114.2) ops/second in (135.422267,983.948728) seconds
2019/09/19-22:12:04  ... thread 2: (1000000,8000000) ops and (7692.4,7323.4) ops/second in (129.999195,1092.383157) seconds
2019/09/19-22:12:06  ... thread 1: (1000000,8000000) ops and (7704.0,7309.7) ops/second in (129.803364,1094.432514) seconds
2019/09/19-22:12:20  ... thread 3: (1000000,8000000) ops and (7693.3,7219.1) ops/second in (129.983748,1108.173864) seconds
2019/09/19-22:12:33  ... thread 0: (1000000,8000000) ops and (7261.1,7132.2) ops/second in (137.720416,1121.669144) seconds
ycsbc        :      35.052 micros/op 28528 ops/sec;    3.2 MB/s (8000000 of 8000000 found)
Microseconds per op:
Count: 32000000 Average: 138.0206  StdDev: 87.29
Min: 2  Median: 135.5167  Max: 175272
Percentiles: P50: 135.52 P75: 165.76 P99: 531.91 P99.9: 839.77 P99.99: 14185.42
------------------------------------------------------
(       1,       2 ]        2   0.000%   0.000% 
(       2,       3 ]      201   0.001%   0.001% 
(       3,       4 ]     7678   0.024%   0.025% 
(       4,       6 ]   458496   1.433%   1.457% 
(       6,      10 ]  2543112   7.947%   9.405% ##
(      10,      15 ]  2581410   8.067%  17.472% ##
(      15,      22 ]  1599209   4.998%  22.469% #
(      22,      34 ]   624658   1.952%  24.421% 
(      34,      51 ]   184084   0.575%  24.996% 
(      51,      76 ]    37946   0.119%  25.115% 
(      76,     110 ]  1212761   3.790%  28.905% #
(     110,     170 ] 15872989  49.603%  78.508% ##########
(     170,     250 ]  3706638  11.583%  90.091% ##
(     250,     380 ]  2139578   6.686%  96.777% #
(     380,     580 ]   936416   2.926%  99.704% #
(     580,     870 ]    70133   0.219%  99.923% 
(     870,    1300 ]     7762   0.024%  99.947% 
(    1300,    1900 ]     3109   0.010%  99.957% 
(    1900,    2900 ]     3319   0.010%  99.967% 
(    2900,    4400 ]     2831   0.009%  99.976% 
(    4400,    6600 ]     1886   0.006%  99.982% 
(    6600,    9900 ]     1391   0.004%  99.986% 
(    9900,   14000 ]     1129   0.004%  99.990% 
(   14000,   22000 ]     2675   0.008%  99.998% 
(   22000,   33000 ]      470   0.001% 100.000% 
(   33000,   50000 ]       77   0.000% 100.000% 
(   50000,   75000 ]        5   0.000% 100.000% 
(   75000,  110000 ]        8   0.000% 100.000% 
(  110000,  170000 ]       25   0.000% 100.000% 
(  170000,  250000 ]        2   0.000% 100.000% 

2019/09/19-22:14:41  ... thread 2: (1000000,1000000) ops and (7977.2,7977.2) ops/second in (125.357229,125.357229) seconds
2019/09/19-22:14:41  ... thread 3: (1000000,1000000) ops and (7958.0,7958.0) ops/second in (125.660178,125.660178) seconds
2019/09/19-22:14:44  ... thread 0: (1000000,1000000) ops and (7824.5,7824.5) ops/second in (127.804097,127.804097) seconds
2019/09/19-22:14:49  ... thread 1: (1000000,1000000) ops and (7494.2,7494.2) ops/second in (133.436726,133.436726) seconds
2019/09/19-22:16:46  ... thread 3: (1000000,2000000) ops and (8054.4,8005.9) ops/second in (124.156109,249.816287) seconds
2019/09/19-22:16:47  ... thread 2: (1000000,2000000) ops and (7928.9,7953.0) ops/second in (126.121416,251.478645) seconds
2019/09/19-22:16:48  ... thread 0: (1000000,2000000) ops and (8048.0,7934.7) ops/second in (124.254246,252.058343) seconds
2019/09/19-22:16:56  ... thread 1: (1000000,2000000) ops and (7904.7,7694.0) ops/second in (126.506912,259.943638) seconds
2019/09/19-22:18:50  ... thread 3: (1000000,3000000) ops and (8063.7,8025.1) ops/second in (124.011863,373.828150) seconds
2019/09/19-22:18:52  ... thread 0: (1000000,3000000) ops and (8069.2,7979.0) ops/second in (123.927851,375.986194) seconds
2019/09/19-22:18:54  ... thread 2: (1000000,3000000) ops and (7878.5,7928.0) ops/second in (126.928300,378.406945) seconds
2019/09/19-22:19:02  ... thread 1: (1000000,3000000) ops and (7893.8,7759.5) ops/second in (126.680911,386.624549) seconds
2019/09/19-22:20:56  ... thread 0: (1000000,4000000) ops and (8075.6,8002.9) ops/second in (123.829641,499.815835) seconds
2019/09/19-22:20:58  ... thread 2: (1000000,4000000) ops and (8068.1,7962.5) ops/second in (123.945176,502.352121) seconds
2019/09/19-22:20:58  ... thread 3: (1000000,4000000) ops and (7763.2,7958.0) ops/second in (128.812123,502.640273) seconds
2019/09/19-22:21:06  ... thread 1: (1000000,4000000) ops and (8066.9,7834.1) ops/second in (123.962932,510.587481) seconds
2019/09/19-22:22:59  ... thread 0: (1000000,5000000) ops and (8104.7,8023.1) ops/second in (123.385394,623.201229) seconds
2019/09/19-22:23:02  ... thread 2: (1000000,5000000) ops and (8100.0,7989.7) ops/second in (123.457180,625.809301) seconds
2019/09/19-22:23:06  ... thread 3: (1000000,5000000) ops and (7810.7,7928.1) ops/second in (128.029183,630.669456) seconds
2019/09/19-22:23:10  ... thread 1: (1000000,5000000) ops and (8086.5,7883.3) ops/second in (123.663405,634.250886) seconds
2019/09/19-22:25:06  ... thread 2: (1000000,6000000) ops and (8048.4,7999.4) ops/second in (124.247848,750.057149) seconds
2019/09/19-22:25:08  ... thread 0: (1000000,6000000) ops and (7729.4,7972.6) ops/second in (129.376420,752.577649) seconds
2019/09/19-22:25:14  ... thread 1: (1000000,6000000) ops and (8031.8,7907.7) ops/second in (124.504774,758.755660) seconds
2019/09/19-22:25:15  ... thread 3: (1000000,6000000) ops and (7785.7,7904.0) ops/second in (128.440218,759.109674) seconds
2019/09/19-22:27:12  ... thread 2: (1000000,7000000) ops and (7917.2,7987.5) ops/second in (126.307367,876.364516) seconds
2019/09/19-22:27:15  ... thread 0: (1000000,7000000) ops and (7898.4,7961.9) ops/second in (126.607225,879.184874) seconds
2019/09/19-22:27:20  ... thread 1: (1000000,7000000) ops and (7938.2,7912.0) ops/second in (125.973426,884.729086) seconds
2019/09/19-22:27:23  ... thread 3: (1000000,7000000) ops and (7830.3,7893.4) ops/second in (127.709759,886.819433) seconds
2019/09/19-22:29:15  ... thread 2: (1000000,8000000) ops and (8115.2,8003.3) ops/second in (123.225609,999.590125) seconds
2019/09/19-22:29:18  ... thread 0: (1000000,8000000) ops and (8135.1,7983.2) ops/second in (122.924538,1002.109412) seconds
2019/09/19-22:29:25  ... thread 3: (1000000,8000000) ops and (8162.4,7926.0) ops/second in (122.513123,1009.332556) seconds
2019/09/19-22:29:28  ... thread 1: (1000000,8000000) ops and (7829.7,7901.6) ops/second in (127.718783,1012.447869) seconds
ycsbb        :      31.639 micros/op 31606 ops/sec;    3.5 MB/s (7599999 of 8000000 found)
Microseconds per op:
Count: 32000000 Average: 125.7337  StdDev: 39.41
Min: 0  Median: 131.6440  Max: 186057
Percentiles: P50: 131.64 P75: 163.47 P99: 508.74 P99.9: 681.09 P99.99: 2140.41
------------------------------------------------------
[       0,       1 ]     4824   0.015%   0.015% 
(       1,       2 ]    14249   0.045%   0.060% 
(       2,       3 ]    72904   0.228%   0.287% 
(       3,       4 ]   179246   0.560%   0.848% 
(       4,       6 ]  1044329   3.264%   4.111% #
(       6,      10 ]  3158277   9.870%  13.981% ##
(      10,      15 ]  2493918   7.793%  21.774% ##
(      15,      22 ]  1568323   4.901%  26.675% #
(      22,      34 ]   565401   1.767%  28.442% 
(      34,      51 ]   150664   0.471%  28.913% 
(      51,      76 ]    34988   0.109%  29.022% 
(      76,     110 ]  1272419   3.976%  32.999% #
(     110,     170 ] 15081695  47.130%  80.129% #########
(     170,     250 ]  3550517  11.095%  91.224% ##
(     250,     380 ]  1992193   6.226%  97.450% #
(     380,     580 ]   770598   2.408%  99.858% 
(     580,     870 ]    38600   0.121%  99.979% 
(     870,    1300 ]     2059   0.006%  99.985% 
(    1300,    1900 ]     1176   0.004%  99.989% 
(    1900,    2900 ]     1747   0.005%  99.994% 
(    2900,    4400 ]      723   0.002%  99.996% 
(    4400,    6600 ]      449   0.001%  99.998% 
(    6600,    9900 ]      210   0.001%  99.998% 
(    9900,   14000 ]      206   0.001%  99.999% 
(   14000,   22000 ]      173   0.001% 100.000% 
(   22000,   33000 ]      105   0.000% 100.000% 
(   33000,   50000 ]        1   0.000% 100.000% 
(   50000,   75000 ]        2   0.000% 100.000% 
(  110000,  170000 ]        2   0.000% 100.000% 
(  170000,  250000 ]        2   0.000% 100.000% 

2019/09/19-22:31:24  ... thread 2: (1000000,1000000) ops and (9031.2,9031.2) ops/second in (110.727744,110.727744) seconds
2019/09/19-22:31:24  ... thread 1: (1000000,1000000) ops and (9004.1,9004.1) ops/second in (111.060094,111.060094) seconds
2019/09/19-22:31:25  ... thread 3: (1000000,1000000) ops and (8875.0,8875.0) ops/second in (112.676659,112.676659) seconds
2019/09/19-22:31:25  ... thread 0: (1000000,1000000) ops and (8862.7,8862.7) ops/second in (112.831834,112.831834) seconds
2019/09/19-22:33:05  ... thread 1: (1000000,2000000) ops and (9923.1,9441.3) ops/second in (100.775285,211.835379) seconds
2019/09/19-22:33:06  ... thread 3: (1000000,2000000) ops and (9907.3,9362.8) ops/second in (100.935244,213.611903) seconds
2019/09/19-22:33:06  ... thread 0: (1000000,2000000) ops and (9879.4,9343.5) ops/second in (101.220589,214.052423) seconds
2019/09/19-22:33:10  ... thread 2: (1000000,2000000) ops and (9380.1,9202.3) ops/second in (106.609021,217.336765) seconds
2019/09/19-22:34:48  ... thread 3: (1000000,3000000) ops and (9747.7,9487.7) ops/second in (102.588627,316.200530) seconds
2019/09/19-22:34:49  ... thread 1: (1000000,3000000) ops and (9633.3,9504.4) ops/second in (103.806777,315.642156) seconds
2019/09/19-22:34:50  ... thread 0: (1000000,3000000) ops and (9637.9,9439.6) ops/second in (103.756543,317.808966) seconds
2019/09/19-22:34:56  ... thread 2: (1000000,3000000) ops and (9481.3,9293.5) ops/second in (105.470565,322.807330) seconds
2019/09/19-22:36:33  ... thread 3: (1000000,4000000) ops and (9582.4,9511.2) ops/second in (104.358360,420.558890) seconds
2019/09/19-22:36:33  ... thread 1: (1000000,4000000) ops and (9589.3,9525.5) ops/second in (104.282623,419.924779) seconds
2019/09/19-22:36:36  ... thread 0: (1000000,4000000) ops and (9384.6,9425.8) ops/second in (106.557903,424.366869) seconds
2019/09/19-22:36:40  ... thread 2: (1000000,4000000) ops and (9610.6,9370.8) ops/second in (104.051777,426.859107) seconds
2019/09/19-22:38:14  ... thread 3: (1000000,5000000) ops and (9837.0,9574.6) ops/second in (101.657328,522.216218) seconds
2019/09/19-22:38:15  ... thread 1: (1000000,5000000) ops and (9828.0,9584.5) ops/second in (101.750410,521.675189) seconds
2019/09/19-22:38:21  ... thread 0: (1000000,5000000) ops and (9557.8,9451.9) ops/second in (104.626902,528.993771) seconds
2019/09/19-22:38:24  ... thread 2: (1000000,5000000) ops and (9651.5,9425.6) ops/second in (103.610961,530.470068) seconds
2019/09/19-22:39:56  ... thread 3: (1000000,6000000) ops and (9872.1,9622.9) ops/second in (101.295171,623.511389) seconds
2019/09/19-22:39:57  ... thread 1: (1000000,6000000) ops and (9777.0,9616.1) ops/second in (102.281342,623.956531) seconds
2019/09/19-22:40:04  ... thread 0: (1000000,6000000) ops and (9737.0,9498.3) ops/second in (102.701438,631.695209) seconds
2019/09/19-22:40:07  ... thread 2: (1000000,6000000) ops and (9634.4,9459.8) ops/second in (103.794930,634.264998) seconds
2019/09/19-22:41:37  ... thread 3: (1000000,7000000) ops and (9902.6,9661.9) ops/second in (100.983235,724.494624) seconds
2019/09/19-22:41:38  ... thread 1: (1000000,7000000) ops and (9885.3,9653.6) ops/second in (101.159978,725.116509) seconds
2019/09/19-22:41:49  ... thread 0: (1000000,7000000) ops and (9536.7,9503.7) ops/second in (104.858511,736.553720) seconds
2019/09/19-22:41:50  ... thread 2: (1000000,7000000) ops and (9727.9,9497.2) ops/second in (102.797288,737.062286) seconds
2019/09/19-22:43:17  ... thread 3: (1000000,8000000) ops and (9950.4,9697.1) ops/second in (100.498044,824.992668) seconds
2019/09/19-22:43:18  ... thread 1: (1000000,8000000) ops and (9969.0,9691.9) ops/second in (100.311258,825.427767) seconds
2019/09/19-22:43:29  ... thread 0: (1000000,8000000) ops and (9919.9,9553.8) ops/second in (100.807527,837.361247) seconds
2019/09/19-22:43:30  ... thread 2: (1000000,8000000) ops and (10015.0,9558.9) ops/second in (99.850350,836.912636) seconds
ycsbd        :      26.186 micros/op 38188 ops/sec;    4.2 MB/s (7600000 of 8000000 found)
Microseconds per op:
Count: 32000000 Average: 103.8967  StdDev: 117.17
Min: 0  Median: 117.0116  Max: 33093
Percentiles: P50: 117.01 P75: 156.33 P99: 479.39 P99.9: 592.70 P99.99: 1192.92
------------------------------------------------------
[       0,       1 ]    16824   0.053%   0.053% 
(       1,       2 ]    34962   0.109%   0.162% 
(       2,       3 ]    85606   0.268%   0.429% 
(       3,       4 ]   208894   0.653%   1.082% 
(       4,       6 ]  1850797   5.784%   6.866% #
(       6,      10 ]  5456936  17.053%  23.919% ###
(      10,      15 ]  3546485  11.083%  35.002% ##
(      15,      22 ]  1485718   4.643%  39.644% #
(      22,      34 ]   522627   1.633%  41.278% 
(      34,      51 ]   121377   0.379%  41.657% 
(      51,      76 ]    29127   0.091%  41.748% 
(      76,     110 ]  1214186   3.794%  45.542% #
(     110,     170 ] 12206613  38.146%  83.688% ########
(     170,     250 ]  3029193   9.466%  93.154% ##
(     250,     380 ]  1587398   4.961%  98.115% #
(     380,     580 ]   569973   1.781%  99.896% 
(     580,     870 ]    29318   0.092%  99.988% 
(     870,    1300 ]     1020   0.003%  99.991% 
(    1300,    1900 ]      636   0.002%  99.993% 
(    1900,    2900 ]      961   0.003%  99.996% 
(    2900,    4400 ]      537   0.002%  99.997% 
(    4400,    6600 ]      416   0.001%  99.999% 
(    6600,    9900 ]       50   0.000%  99.999% 
(    9900,   14000 ]       75   0.000%  99.999% 
(   14000,   22000 ]      225   0.001% 100.000% 
(   22000,   33000 ]       45   0.000% 100.000% 
(   33000,   50000 ]        1   0.000% 100.000% 

2019/09/19-22:44:41  ... thread 1: (1000000,1000000) ops and (14500.4,14500.4) ops/second in (68.963708,68.963708) seconds
2019/09/19-22:44:41  ... thread 2: (1000000,1000000) ops and (14457.3,14457.3) ops/second in (69.169063,69.169063) seconds
2019/09/19-22:44:41  ... thread 0: (1000000,1000000) ops and (14446.7,14446.7) ops/second in (69.220055,69.220055) seconds
2019/09/19-22:44:41  ... thread 3: (1000000,1000000) ops and (14433.6,14433.6) ops/second in (69.282904,69.282904) seconds
2019/09/19-22:45:50  ... thread 2: (1000000,2000000) ops and (14523.7,14490.4) ops/second in (68.853040,138.022103) seconds
2019/09/19-22:45:50  ... thread 1: (1000000,2000000) ops and (14513.1,14506.8) ops/second in (68.903103,137.866811) seconds
2019/09/19-22:45:50  ... thread 3: (1000000,2000000) ops and (14537.5,14485.3) ops/second in (68.787849,138.070753) seconds
2019/09/19-22:45:50  ... thread 0: (1000000,2000000) ops and (14523.4,14484.9) ops/second in (68.854384,138.074439) seconds
2019/09/19-22:46:58  ... thread 1: (1000000,3000000) ops and (14687.2,14566.4) ops/second in (68.086621,205.953432) seconds
2019/09/19-22:46:58  ... thread 0: (1000000,3000000) ops and (14679.0,14549.0) ops/second in (68.124629,206.199068) seconds
2019/09/19-22:46:58  ... thread 3: (1000000,3000000) ops and (14666.4,14545.2) ops/second in (68.182952,206.253705) seconds
2019/09/19-22:47:05  ... thread 2: (1000000,3000000) ops and (13398.2,14107.1) ops/second in (74.636838,212.658941) seconds
2019/09/19-22:48:08  ... thread 1: (1000000,4000000) ops and (14337.5,14508.5) ops/second in (69.747081,275.700513) seconds
2019/09/19-22:48:08  ... thread 3: (1000000,4000000) ops and (14318.1,14487.8) ops/second in (69.841506,276.095211) seconds
2019/09/19-22:48:09  ... thread 0: (1000000,4000000) ops and (14232.7,14468.6) ops/second in (70.260930,276.459998) seconds
2019/09/19-22:48:20  ... thread 2: (1000000,4000000) ops and (13320.3,13901.8) ops/second in (75.073164,287.732105) seconds
2019/09/19-22:49:20  ... thread 1: (1000000,5000000) ops and (13934.8,14390.0) ops/second in (71.762711,347.463224) seconds
2019/09/19-22:49:21  ... thread 0: (1000000,5000000) ops and (13830.4,14336.3) ops/second in (72.304500,348.764498) seconds
2019/09/19-22:49:23  ... thread 3: (1000000,5000000) ops and (13408.7,14258.3) ops/second in (74.578280,350.673491) seconds
2019/09/19-22:49:32  ... thread 2: (1000000,5000000) ops and (13873.2,13896.1) ops/second in (72.081596,359.813701) seconds
2019/09/19-22:50:32  ... thread 1: (1000000,6000000) ops and (13786.0,14285.7) ops/second in (72.537197,420.000421) seconds
2019/09/19-22:50:35  ... thread 3: (1000000,6000000) ops and (13845.1,14187.7) ops/second in (72.227630,422.901121) seconds
2019/09/19-22:50:36  ... thread 0: (1000000,6000000) ops and (13320.2,14156.3) ops/second in (75.073691,423.838189) seconds
2019/09/19-22:50:44  ... thread 2: (1000000,6000000) ops and (13915.0,13899.2) ops/second in (71.865031,431.678732) seconds
2019/09/19-22:51:42  ... thread 1: (1000000,7000000) ops and (14318.2,14290.3) ops/second in (69.841351,489.841772) seconds
2019/09/19-22:51:45  ... thread 3: (1000000,7000000) ops and (14259.0,14197.9) ops/second in (70.131080,493.032201) seconds
2019/09/19-22:51:53  ... thread 0: (1000000,7000000) ops and (13025.8,13983.0) ops/second in (76.770680,500.608869) seconds
2019/09/19-22:51:53  ... thread 2: (1000000,7000000) ops and (14329.0,13959.0) ops/second in (69.788596,501.467328) seconds
2019/09/19-22:52:51  ... thread 1: (1000000,8000000) ops and (14515.6,14318.1) ops/second in (68.891427,558.733199) seconds
2019/09/19-22:52:54  ... thread 3: (1000000,8000000) ops and (14472.3,14231.6) ops/second in (69.097391,562.129592) seconds
2019/09/19-22:53:02  ... thread 2: (1000000,8000000) ops and (14479.0,14022.0) ops/second in (69.065385,570.532713) seconds
2019/09/19-22:53:04  ... thread 0: (1000000,8000000) ops and (14012.0,13986.6) ops/second in (71.367156,571.976025) seconds
ycsba        :      17.880 micros/op 55927 ops/sec;    6.2 MB/s (4000000 of 8000000 found)
Microseconds per op:
Count: 32000000 Average: 70.7304  StdDev: 74.20
Min: 0  Median: 9.4202  Max: 149433
Percentiles: P50: 9.42 P75: 135.65 P99: 460.34 P99.9: 644.18 P99.99: 3439.33
------------------------------------------------------
[       0,       1 ]    22653   0.071%   0.071% 
(       1,       2 ]  1411416   4.411%   4.481% #
(       2,       3 ]  4679949  14.625%  19.106% ###
(       3,       4 ]  2908552   9.089%  28.196% ##
(       4,       6 ]  4118643  12.871%  41.066% ###
(       6,      10 ]  3343452  10.448%  51.515% ##
(      10,      15 ]  2104414   6.576%  58.091% #
(      15,      22 ]  1064910   3.328%  61.419% #
(      22,      34 ]   338701   1.058%  62.477% 
(      34,      51 ]    51786   0.162%  62.639% 
(      51,      76 ]    15640   0.049%  62.688% 
(      76,     110 ]   567142   1.772%  64.460% 
(     110,     170 ]  7890262  24.657%  89.117% #####
(     170,     250 ]  1858902   5.809%  94.926% #
(     250,     380 ]  1114266   3.482%  98.408% #
(     380,     580 ]   471302   1.473%  99.881% 
(     580,     870 ]    27156   0.085%  99.966% 
(     870,    1300 ]     2332   0.007%  99.973% 
(    1300,    1900 ]     1685   0.005%  99.979% 
(    1900,    2900 ]     2741   0.009%  99.987% 
(    2900,    4400 ]     2492   0.008%  99.995% 
(    4400,    6600 ]      706   0.002%  99.997% 
(    6600,    9900 ]      204   0.001%  99.998% 
(    9900,   14000 ]      145   0.000%  99.998% 
(   14000,   22000 ]      410   0.001% 100.000% 
(   22000,   33000 ]      125   0.000% 100.000% 
(   33000,   50000 ]        5   0.000% 100.000% 
(   50000,   75000 ]        1   0.000% 100.000% 
(   75000,  110000 ]        1   0.000% 100.000% 
(  110000,  170000 ]        7   0.000% 100.000% 

2019/09/19-22:55:26  ... thread 2: (1000000,1000000) ops and (7134.2,7134.2) ops/second in (140.170820,140.170820) seconds
2019/09/19-22:55:27  ... thread 0: (1000000,1000000) ops and (7130.5,7130.5) ops/second in (140.243489,140.243489) seconds
2019/09/19-22:55:29  ... thread 3: (1000000,1000000) ops and (7006.5,7006.5) ops/second in (142.725443,142.725443) seconds
2019/09/19-22:55:32  ... thread 1: (1000000,1000000) ops and (6851.1,6851.1) ops/second in (145.961008,145.961008) seconds
2019/09/19-22:57:47  ... thread 2: (1000000,2000000) ops and (7116.2,7125.2) ops/second in (140.523982,280.694802) seconds
2019/09/19-22:57:48  ... thread 3: (1000000,2000000) ops and (7207.9,7105.8) ops/second in (138.736506,281.461949) seconds
2019/09/19-22:57:53  ... thread 0: (1000000,2000000) ops and (6816.9,6970.1) ops/second in (146.694655,286.938144) seconds
2019/09/19-22:57:55  ... thread 1: (1000000,2000000) ops and (7006.6,6928.0) ops/second in (142.722355,288.683363) seconds
2019/09/19-23:00:08  ... thread 2: (1000000,3000000) ops and (7091.8,7114.0) ops/second in (141.007005,421.701807) seconds
2019/09/19-23:00:09  ... thread 3: (1000000,3000000) ops and (7073.0,7094.8) ops/second in (141.383718,422.845667) seconds
2019/09/19-23:00:17  ... thread 1: (1000000,3000000) ops and (7042.5,6965.8) ops/second in (141.995135,430.678498) seconds
2019/09/19-23:00:22  ... thread 0: (1000000,3000000) ops and (6740.9,6892.0) ops/second in (148.348681,435.286825) seconds
2019/09/19-23:02:29  ... thread 2: (1000000,4000000) ops and (7103.0,7111.3) ops/second in (140.785114,562.486921) seconds
2019/09/19-23:02:29  ... thread 3: (1000000,4000000) ops and (7152.5,7109.1) ops/second in (139.810883,562.656550) seconds
2019/09/19-23:02:38  ... thread 1: (1000000,4000000) ops and (7108.4,7000.9) ops/second in (140.678653,571.357151) seconds
2019/09/19-23:02:46  ... thread 0: (1000000,4000000) ops and (6915.1,6897.8) ops/second in (144.611229,579.898054) seconds
2019/09/19-23:04:48  ... thread 3: (1000000,5000000) ops and (7179.5,7123.1) ops/second in (139.284983,701.941533) seconds
2019/09/19-23:04:51  ... thread 2: (1000000,5000000) ops and (7010.4,7090.9) ops/second in (142.645707,705.132628) seconds
2019/09/19-23:04:58  ... thread 1: (1000000,5000000) ops and (7126.9,7025.7) ops/second in (140.313233,711.670384) seconds
2019/09/19-23:05:14  ... thread 0: (1000000,5000000) ops and (6777.1,6873.3) ops/second in (147.555185,727.453239) seconds
2019/09/19-23:07:07  ... thread 3: (1000000,6000000) ops and (7178.2,7132.2) ops/second in (139.311215,841.252748) seconds
2019/09/19-23:07:18  ... thread 1: (1000000,6000000) ops and (7130.0,7042.9) ops/second in (140.251550,851.921934) seconds
2019/09/19-23:07:19  ... thread 2: (1000000,6000000) ops and (6754.5,7032.5) ops/second in (148.048427,853.181055) seconds
2019/09/19-23:07:37  ... thread 0: (1000000,6000000) ops and (6998.6,6893.9) ops/second in (142.886688,870.339927) seconds
2019/09/19-23:09:27  ... thread 3: (1000000,7000000) ops and (7161.2,7136.3) ops/second in (139.641436,980.894184) seconds
2019/09/19-23:09:39  ... thread 1: (1000000,7000000) ops and (7107.0,7052.0) ops/second in (140.706158,992.628092) seconds
2019/09/19-23:09:46  ... thread 2: (1000000,7000000) ops and (6814.1,7000.5) ops/second in (146.754040,999.935095) seconds
2019/09/19-23:10:04  ... thread 0: (1000000,7000000) ops and (6797.8,6880.0) ops/second in (147.107426,1017.447353) seconds
2019/09/19-23:11:53  ... thread 3: (1000000,8000000) ops and (6840.5,7098.0) ops/second in (146.188964,1127.083148) seconds
2019/09/19-23:12:01  ... thread 1: (1000000,8000000) ops and (7025.3,7048.6) ops/second in (142.342516,1134.970608) seconds
2019/09/19-23:12:08  ... thread 2: (1000000,8000000) ops and (7034.8,7004.7) ops/second in (142.151175,1142.086270) seconds
2019/09/19-23:12:25  ... thread 0: (1000000,8000000) ops and (7063.6,6902.4) ops/second in (141.570091,1159.017444) seconds
ycsbf        :      36.222 micros/op 27607 ops/sec;    3.1 MB/s (7999999 of 8000000 found)
Microseconds per op:
Count: 32000000 Average: 142.5987  StdDev: 37.26
Min: 1  Median: 138.3854  Max: 37518
Percentiles: P50: 138.39 P75: 169.40 P99: 537.06 P99.9: 803.73 P99.99: 3847.48
------------------------------------------------------
[       0,       1 ]    11801   0.037%   0.037% 
(       1,       2 ]    37266   0.116%   0.153% 
(       2,       3 ]    11613   0.036%   0.190% 
(       3,       4 ]    22498   0.070%   0.260% 
(       4,       6 ]    39582   0.124%   0.384% 
(       6,      10 ]   627693   1.962%   2.345% 
(      10,      15 ]  2435385   7.611%   9.956% ##
(      15,      22 ]  2936821   9.178%  19.133% ##
(      22,      34 ]  1538103   4.807%  23.940% #
(      34,      51 ]   324536   1.014%  24.954% 
(      51,      76 ]    42868   0.134%  25.088% 
(      76,     110 ]   650524   2.033%  27.121% 
(     110,     170 ] 15475511  48.361%  75.482% ##########
(     170,     250 ]  4273495  13.355%  88.837% ###
(     250,     380 ]  2405297   7.517%  96.353% ##
(     380,     580 ]  1078546   3.370%  99.724% #
(     580,     870 ]    73184   0.229%  99.952% 
(     870,    1300 ]     3983   0.012%  99.965% 
(    1300,    1900 ]     2192   0.007%  99.972% 
(    1900,    2900 ]     3755   0.012%  99.983% 
(    2900,    4400 ]     3399   0.011%  99.994% 
(    4400,    6600 ]     1230   0.004%  99.998% 
(    6600,    9900 ]      181   0.001%  99.998% 
(    9900,   14000 ]      133   0.000%  99.999% 
(   14000,   22000 ]      302   0.001% 100.000% 
(   22000,   33000 ]      100   0.000% 100.000% 
(   33000,   50000 ]        2   0.000% 100.000% 

2019/09/19-23:30:30  ... thread 2: (1000000,1000000) ops and (923.8,923.8) ops/second in (1082.508025,1082.508025) seconds
2019/09/19-23:30:48  ... thread 3: (1000000,1000000) ops and (908.8,908.8) ops/second in (1100.308006,1100.308006) seconds
2019/09/19-23:31:48  ... thread 0: (1000000,1000000) ops and (862.1,862.1) ops/second in (1159.928966,1159.928966) seconds
2019/09/19-23:32:00  ... thread 1: (1000000,1000000) ops and (853.0,853.0) ops/second in (1172.367961,1172.367961) seconds
2019/09/19-23:49:16  ... thread 2: (1000000,2000000) ops and (888.7,905.9) ops/second in (1125.292855,2207.800880) seconds
2019/09/19-23:49:38  ... thread 1: (1000000,2000000) ops and (945.6,896.9) ops/second in (1057.519291,2229.887252) seconds
2019/09/19-23:49:51  ... thread 0: (1000000,2000000) ops and (923.0,891.5) ops/second in (1083.398129,2243.327095) seconds
2019/09/19-23:50:00  ... thread 3: (1000000,2000000) ops and (868.5,888.2) ops/second in (1151.429199,2251.737205) seconds
ycsbe        :     281.481 micros/op 3552 ops/sec;   37.4 MB/s (2054 of 2000000 found)
Microseconds per op:
Count: 8000000 Average: 1116.5923  StdDev: 474.51
Min: 2  Median: 1110.6696  Max: 83258
Percentiles: P50: 1110.67 P75: 1555.28 P99: 3104.34 P99.9: 5917.26 P99.99: 21105.26
------------------------------------------------------
(       1,       2 ]        5   0.000%   0.000% 
(       2,       3 ]      357   0.004%   0.005% 
(       3,       4 ]     6624   0.083%   0.087% 
(       4,       6 ]    13308   0.166%   0.254% 
(       6,      10 ]    27231   0.340%   0.594% 
(      10,      15 ]    86891   1.086%   1.680% 
(      15,      22 ]   179425   2.243%   3.923% 
(      22,      34 ]    81392   1.017%   4.940% 
(      34,      51 ]     3217   0.040%   4.981% 
(      51,      76 ]      253   0.003%   4.984% 
(      76,     110 ]     2308   0.029%   5.013% 
(     110,     170 ]    32065   0.401%   5.413% 
(     170,     250 ]    87641   1.096%   6.509% 
(     250,     380 ]   385859   4.823%  11.332% #
(     380,     580 ]   717163   8.965%  20.297% ##
(     580,     870 ]  1272428  15.905%  36.202% ###
(     870,    1300 ]  1972198  24.652%  60.855% #####
(    1300,    1900 ]  2659790  33.247%  94.102% #######
(    1900,    2900 ]   382656   4.783%  98.885% #
(    2900,    4400 ]    67455   0.843%  99.728% 
(    4400,    6600 ]    19914   0.249%  99.977% 
(    6600,    9900 ]      424   0.005%  99.983% 
(    9900,   14000 ]      191   0.002%  99.985% 
(   14000,   22000 ]      456   0.006%  99.991% 
(   22000,   33000 ]      419   0.005%  99.996% 
(   33000,   50000 ]      297   0.004% 100.000% 
(   50000,   75000 ]       31   0.000% 100.000% 
(   75000,  110000 ]        2   0.000% 100.000% 


                               Compactions
Level Time(sec) Read(MB) Write(MB)
--------------------------------------------------
  0     19.27     0.00   3256.02
  1     45.08  6204.57   6061.97
  2    272.43 42315.75  41041.23
BucketCount: 800
WriteAmplification: 15.4665

seq# 1535506796, log# 1403, min log#1393, file# 118390